{
  "backend/main.mo": "Motoko canister defining user profiles and transaction CRUD with access control and placeholder summary update logic.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries of key frontend files describing their roles in the app’s UI, logic, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme design tokens and global styling rules.",
  "frontend/index.html": "Base HTML entry point that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile setup flow, view switching, and global theming/toasts.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component displaying an access denied message with optional retry action.",
  "frontend/src/components/layout/AppShell.tsx": "Application layout with header navigation, user display, footer, and decorative background pattern.",
  "frontend/src/features/auth/ProfileSetupDialog.tsx": "Modal dialog prompting authenticated users to enter and save their profile name.",
  "frontend/src/features/auth/SignInScreen.tsx": "Internet Identity sign‑in screen with branding, pattern background, and login button.",
  "frontend/src/features/auth/SignOutButton.tsx": "Provides a sign‑out button that clears Internet Identity data and React Query cache.",
  "frontend/src/features/dashboard/CategoryBreakdownPanel.tsx": "Computes and displays expense totals by category with percentages and progress bars.",
  "frontend/src/features/dashboard/DashboardPage.tsx": "Renders the main dashboard with date filters, summary cards, trend chart, and category breakdown.",
  "frontend/src/features/dashboard/MonthlyTrendChart.tsx": "Aggregates transactions by month and shows income vs expenses in a bar chart.",
  "frontend/src/features/reports/PrintableReport.tsx": "Generates a printable financial report with totals and a detailed transaction table.",
  "frontend/src/features/reports/ReportsPage.tsx": "Allows users to filter transactions and generate printable or CSV financial reports.",
  "frontend/src/features/transactions/TransactionFilters.tsx": "UI component providing filters for transaction type, category, dates, and sorting.",
  "frontend/src/features/transactions/TransactionFormDialog.tsx": "Dialog component for creating or editing a transaction with fields for date, amount, currency, category, and description. Handles validation, currency logic, and submits add/update mutations.",
  "frontend/src/features/transactions/TransactionsPage.tsx": "Page showing the transactions list with filtering, sorting, and a dialog to add or edit transactions. Fetches user transactions and manages filter and dialog UI state.",
  "frontend/src/features/transactions/TransactionsTable.tsx": "Table component that displays transactions with formatted fields and provides edit and delete actions. Supports delete confirmation and triggers onEdit callbacks.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on the current identity and refreshes dependent queries when the actor changes. Supports authenticated and anonymous actor creation.",
  "frontend/src/hooks/useCallerUserProfile.ts": "Hooks to fetch and update the current user's profile via the backend actor, with caching and invalidation. Depends on actor availability and loading state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, including login, logout, identity loading, and exposing login status. Wraps AuthClient setup and identity persistence.",
  "frontend/src/hooks/useTransactions.ts": "Hooks for fetching, adding, updating, and deleting transactions through the backend actor with react-query. Automatically invalidates the transactions query on mutations.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables for light/dark modes, global styles, and extensive print-specific utility overrides.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, importing global styles.",
  "frontend/src/utils/csv.ts": "Generates a CSV export of transactions, sorting by date and escaping fields as needed.",
  "frontend/src/utils/financeTime.ts": "Provides helpers for converting between HTML date strings, JS Date objects, and backend nanosecond timestamps.",
  "frontend/src/utils/formatters.ts": "Formats currency, categories, and timestamps into human‑readable INR values and dates.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration extending themes with CSS variable‑based colors, typography, animations, and plugins.",
  "project_state.json": "Tracks current project state, features, issues, architecture notes, and generated assets metadata."
}